### Report for gp2gp_dashboard on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (15 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.gp2gp_dashboard_output_bucket_write_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gp2gp_dashboard_output_bucket_write_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
              + "s3:PutBucketWebsite",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + resources = [
              + "arn:aws:s3:::prm-service-dashboard-dev",
              + "arn:aws:s3:::prm-service-dashboard-dev/*",
            ]
          + sid       = "WriteObjects"
        }
    }

  # aws_cloudfront_distribution.dashboard_s3_distribution will be created
  + resource "aws_cloudfront_distribution" "dashboard_s3_distribution" {
      + aliases                         = [
          + "dev.gp-registrations-data.nhs.uk",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "ApplicationRole"     = "AwsCloudfrontDistribution"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-GP2GP-service-dashboard"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "Y"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                        = {
          + "ApplicationRole"     = "AwsCloudfrontDistribution"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-GP2GP-service-dashboard"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "Y"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = (known after apply)
          + response_completion_timeout = (known after apply)
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
                # (1 unchanged attribute hidden)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = "arn:aws:acm:us-east-1:343515223843:certificate/c53966f5-700c-498e-b5cb-0de70b2511eb"
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2019"
          + ssl_support_method             = "sni-only"
        }
    }

  # aws_ecs_task_definition.gp2gp_dashboard will be created
  + resource "aws_ecs_task_definition" "gp2gp_dashboard" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (sensitive value)
      + family                   = "dev-gp2gp-dashboard"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                 = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.gp2gp_dashboard_output_bucket_write_access will be created
  + resource "aws_iam_policy" "gp2gp_dashboard_output_bucket_write_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "gp2gp-dashboard-output-buckets-dev-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.metrics_input_bucket_read_access will be created
  + resource "aws_iam_policy" "metrics_input_bucket_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-metrics-input-bucket-read-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-metrics-dev"
                      + Sid      = "ListBucket"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-metrics-dev/*"
                      + Sid      = "ReadObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.metrics_ssm_parameter_read_access will be created
  + resource "aws_iam_policy" "metrics_ssm_parameter_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-metrics-ssm-parameter-read-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/data-pipeline/metrics-calculator/practice-metrics-s3-path",
                          + "arn:aws:ssm:eu-west-2:343515223843:parameter/registrations/dev/data-pipeline/metrics-calculator/national-metrics-s3-path",
                        ]
                      + Sid      = "GetSSMParameter"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.gp2gp_dashboard will be created
  + resource "aws_iam_role" "gp2gp_dashboard" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for gp2gp dashboard ECS task"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-registrations-gp2gp-dashboard"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gp2gp_dashboard_metrics_input_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "gp2gp_dashboard_metrics_input_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-gp2gp-dashboard"
    }

  # aws_iam_role_policy_attachment.gp2gp_dashboard_metrics_ssm_parameter_read_access will be created
  + resource "aws_iam_role_policy_attachment" "gp2gp_dashboard_metrics_ssm_parameter_read_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-gp2gp-dashboard"
    }

  # aws_iam_role_policy_attachment.gp2gp_dashboard_output_bucket_write_access will be created
  + resource "aws_iam_role_policy_attachment" "gp2gp_dashboard_output_bucket_write_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-gp2gp-dashboard"
    }

  # aws_s3_bucket.dashboard_website will be created
  + resource "aws_s3_bucket" "dashboard_website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prm-service-dashboard-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "GP2GP-service-dashboard-s3-bucket"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "Y"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "GP2GP-service-dashboard-s3-bucket"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "Y"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.dashboard_website will be created
  + resource "aws_s3_bucket_acl" "dashboard_website" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.dashboard_website will be created
  + resource "aws_s3_bucket_ownership_controls" "dashboard_website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_website_configuration.dashboard_website will be created
  + resource "aws_s3_bucket_website_configuration" "dashboard_website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "eu-west-2"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # aws_ssm_parameter.gp2gp_dashboard_iam_role_arn will be created
  + resource "aws_ssm_parameter" "gp2gp_dashboard_iam_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/gp2gp-dashboard/iam-role-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-iam-role-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-iam-role-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.gp2gp_dashboard_task_definition_arn will be created
  + resource "aws_ssm_parameter" "gp2gp_dashboard_task_definition_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/gp2gp-dashboard/task-definition-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-gp2gp-dashboard-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

```

</details>